{
    "\u0000": 0,
    "\u0001": 1,
    "\u0002": 2,
    "\u0003": 3,
    "\u0004": 4,
    "\u0005": 5,
    "\u0006": 6,
    "\u0007": 7,
    "\b": 8,
    "\t": 9,
    "\n": 10,
    "\u000b": 11,
    "\f": 12,
    "\r": 13,
    "\u000e": 14,
    "\u000f": 15,
    "\u0010": 16,
    "\u0011": 17,
    "\u0012": 18,
    "\u0013": 19,
    "\u0014": 20,
    "\u0015": 21,
    "\u0016": 22,
    "\u0017": 23,
    "\u0018": 24,
    "\u0019": 25,
    "\u001a": 26,
    "\u001b": 27,
    "\u001c": 28,
    "\u001d": 29,
    "\u001e": 30,
    "\u001f": 31,
    " ": 32,
    "!": 33,
    "\"": 34,
    "#": 35,
    "$": 36,
    "%": 37,
    "&": 38,
    "'": 39,
    "(": 40,
    ")": 41,
    "*": 42,
    "+": 43,
    ",": 44,
    "-": 45,
    ".": 46,
    "/": 47,
    "0": 48,
    "1": 49,
    "2": 50,
    "3": 51,
    "4": 52,
    "5": 53,
    "6": 54,
    "7": 55,
    "8": 56,
    "9": 57,
    ":": 58,
    ";": 59,
    "<": 60,
    "=": 61,
    ">": 62,
    "?": 63,
    "@": 64,
    "A": 65,
    "B": 66,
    "C": 67,
    "D": 68,
    "E": 69,
    "F": 70,
    "G": 71,
    "H": 72,
    "I": 73,
    "J": 74,
    "K": 75,
    "L": 76,
    "M": 77,
    "N": 78,
    "O": 79,
    "P": 80,
    "Q": 81,
    "R": 82,
    "S": 83,
    "T": 84,
    "U": 85,
    "V": 86,
    "W": 87,
    "X": 88,
    "Y": 89,
    "Z": 90,
    "[": 91,
    "\\": 92,
    "]": 93,
    "^": 94,
    "_": 95,
    "`": 96,
    "a": 97,
    "b": 98,
    "c": 99,
    "d": 100,
    "e": 101,
    "f": 102,
    "g": 103,
    "h": 104,
    "i": 105,
    "j": 106,
    "k": 107,
    "l": 108,
    "m": 109,
    "n": 110,
    "o": 111,
    "p": 112,
    "q": 113,
    "r": 114,
    "s": 115,
    "t": 116,
    "u": 117,
    "v": 118,
    "w": 119,
    "x": 120,
    "y": 121,
    "z": 122,
    "{": 123,
    "|": 124,
    "}": 125,
    "~": 126,
    "\u007f": 127,
    "\u0080": 128,
    "\u0081": 129,
    "\u0082": 130,
    "\u0083": 131,
    "\u0084": 132,
    "\u0085": 133,
    "\u0086": 134,
    "\u0087": 135,
    "\u0088": 136,
    "\u0089": 137,
    "\u008a": 138,
    "\u008b": 139,
    "\u008c": 140,
    "\u008d": 141,
    "\u008e": 142,
    "\u008f": 143,
    "\u0090": 144,
    "\u0091": 145,
    "\u0092": 146,
    "\u0093": 147,
    "\u0094": 148,
    "\u0095": 149,
    "\u0096": 150,
    "\u0097": 151,
    "\u0098": 152,
    "\u0099": 153,
    "\u009a": 154,
    "\u009b": 155,
    "\u009c": 156,
    "\u009d": 157,
    "\u009e": 158,
    "\u009f": 159,
    "\u00a0": 160,
    "\u00a1": 161,
    "\u00a2": 162,
    "\u00a3": 163,
    "\u00a4": 164,
    "\u00a5": 165,
    "\u00a6": 166,
    "\u00a7": 167,
    "\u00a8": 168,
    "\u00a9": 169,
    "\u00aa": 170,
    "\u00ab": 171,
    "\u00ac": 172,
    "\u00ad": 173,
    "\u00ae": 174,
    "\u00af": 175,
    "\u00b0": 176,
    "\u00b1": 177,
    "\u00b2": 178,
    "\u00b3": 179,
    "\u00b4": 180,
    "\u00b5": 181,
    "\u00b6": 182,
    "\u00b7": 183,
    "\u00b8": 184,
    "\u00b9": 185,
    "\u00ba": 186,
    "\u00bb": 187,
    "\u00bc": 188,
    "\u00bd": 189,
    "\u00be": 190,
    "\u00bf": 191,
    "\u00c0": 192,
    "\u00c1": 193,
    "\u00c2": 194,
    "\u00c3": 195,
    "\u00c4": 196,
    "\u00c5": 197,
    "\u00c6": 198,
    "\u00c7": 199,
    "\u00c8": 200,
    "\u00c9": 201,
    "\u00ca": 202,
    "\u00cb": 203,
    "\u00cc": 204,
    "\u00cd": 205,
    "\u00ce": 206,
    "\u00cf": 207,
    "\u00d0": 208,
    "\u00d1": 209,
    "\u00d2": 210,
    "\u00d3": 211,
    "\u00d4": 212,
    "\u00d5": 213,
    "\u00d6": 214,
    "\u00d7": 215,
    "\u00d8": 216,
    "\u00d9": 217,
    "\u00da": 218,
    "\u00db": 219,
    "\u00dc": 220,
    "\u00dd": 221,
    "\u00de": 222,
    "\u00df": 223,
    "\u00e0": 224,
    "\u00e1": 225,
    "\u00e2": 226,
    "\u00e3": 227,
    "\u00e4": 228,
    "\u00e5": 229,
    "\u00e6": 230,
    "\u00e7": 231,
    "\u00e8": 232,
    "\u00e9": 233,
    "\u00ea": 234,
    "\u00eb": 235,
    "\u00ec": 236,
    "\u00ed": 237,
    "\u00ee": 238,
    "\u00ef": 239,
    "\u00f0": 240,
    "\u00f1": 241,
    "\u00f2": 242,
    "\u00f3": 243,
    "\u00f4": 244,
    "\u00f5": 245,
    "\u00f6": 246,
    "\u00f7": 247,
    "\u00f8": 248,
    "\u00f9": 249,
    "\u00fa": 250,
    "\u00fb": 251,
    "\u00fc": 252,
    "\u00fd": 253,
    "\u00fe": 254,
    "\u00ff": 255,
    "(32, 97)": 256,
    "(32, 105)": 257,
    "(32, 116)": 258,
    "(32, 46)": 259,
    "(111, 117)": 260,
    "(32, 119)": 261,
    "(104, 97)": 262,
    "(114, 101)": 263,
    "(105, 110)": 264,
    "(32, 109)": 265,
    "(104, 101)": 266,
    "(32, 115)": 267,
    "(32, 121)": 268,
    "(32, 100)": 269,
    "(32, 108)": 270,
    "(268, 260)": 271,
    "(118, 101)": 272,
    "(32, 98)": 273,
    "(264, 103)": 274,
    "(32, 102)": 275,
    "(32, 99)": 276,
    "(258, 111)": 277,
    "(32, 63)": 278,
    "(111, 114)": 279,
    "(32, 44)": 280,
    "(269, 111)": 281,
    "(32, 103)": 282,
    "(262, 116)": 283,
    "(259, 124)": 284,
    "(108, 108)": 285,
    "(32, 111)": 286,
    "(110, 100)": 287,
    "(32, 110)": 288,
    "(258, 266)": 289,
    "(101, 115)": 290,
    "(32, 112)": 291,
    "(278, 124)": 292,
    "(257, 115)": 293,
    "(111, 116)": 294,
    "(107, 101)": 295,
    "(32, 262)": 296,
    "(105, 116)": 297,
    "(104, 111)": 298,
    "(256, 109)": 299,
    "(265, 121)": 300,
    "(270, 105)": 301,
    "(97, 110)": 302,
    "(97, 116)": 303,
    "(101, 114)": 304,
    "(32, 33)": 305,
    "(115, 116)": 306,
    "(111, 111)": 307,
    "(109, 101)": 308,
    "(97, 114)": 309,
    "(97, 121)": 310,
    "(296, 272)": 311,
    "(257, 110)": 312,
    "(256, 263)": 313,
    "(105, 99)": 314,
    "(32, 101)": 315,
    "(256, 287)": 316,
    "(301, 295)": 317,
    "(111, 110)": 318,
    "(273, 101)": 319,
    "(32, 298)": 320,
    "(257, 116)": 321,
    "(270, 111)": 322,
    "(286, 102)": 323,
    "(104, 105)": 324,
    "(288, 294)": 325,
    "(108, 100)": 326,
    "(267, 111)": 327,
    "(101, 116)": 328,
    "(258, 283)": 329,
    "(101, 110)": 330,
    "(101, 100)": 331,
    "(32, 106)": 332,
    "(124, 105)": 333,
    "(32, 263)": 334,
    "(275, 279)": 335,
    "(117, 116)": 336,
    "(322, 272)": 337,
    "(286, 110)": 338,
    "(97, 108)": 339,
    "(97, 115)": 340,
    "(307, 100)": 341,
    "(114, 105)": 342,
    "(117, 115)": 343,
    "(114, 111)": 344,
    "(97, 285)": 345,
    "(103, 104)": 346,
    "(114, 121)": 347,
    "(256, 110)": 348,
    "(260, 116)": 349,
    "(261, 283)": 350,
    "(265, 101)": 351,
    "(32, 266)": 352,
    "(97, 100)": 353,
    "(108, 101)": 354,
    "(320, 119)": 355,
    "(117, 306)": 356,
    "(261, 279)": 357,
    "(111, 119)": 358,
    "(99, 104)": 359,
    "(261, 101)": 360,
    "(108, 121)": 361,
    "(32, 107)": 362,
    "(267, 116)": 363,
    "(105, 100)": 364,
    "(117, 110)": 365,
    "(273, 336)": 366,
    "(260, 326)": 367,
    "(114, 97)": 368,
    "(357, 107)": 369,
    "(276, 111)": 370,
    "(105, 115)": 371,
    "(275, 97)": 372,
    "(297, 104)": 373,
    "(258, 104)": 374,
    "(261, 373)": 375,
    "(116, 283)": 376,
    "(265, 111)": 377,
    "(332, 356)": 378,
    "(101, 97)": 379,
    "(271, 114)": 380,
    "(282, 111)": 381,
    "(282, 341)": 382,
    "(345, 121)": 383,
    "(115, 101)": 384,
    "(305, 124)": 385,
    "(256, 116)": 386,
    "(346, 116)": 387,
    "(288, 101)": 388,
    "(277, 111)": 389,
    "(256, 98)": 390,
    "(297, 101)": 391,
    "(291, 108)": 392,
    "(266, 114)": 393,
    "(256, 108)": 394,
    "(276, 302)": 395,
    "(99, 101)": 396,
    "(314, 101)": 397,
    "(390, 349)": 398,
    "(105, 285)": 399,
    "(110, 116)": 400,
    "(111, 108)": 401,
    "(287, 115)": 402,
    "(263, 303)": 403,
    "(32, 104)": 404,
    "(327, 308)": 405,
    "(272, 114)": 406,
    "(99, 107)": 407,
    "(272, 347)": 408,
    "(105, 114)": 409,
    "(348, 121)": 410,
    "(111, 104)": 411,
    "(258, 105)": 412,
    "(97, 295)": 413,
    "(117, 114)": 414,
    "(261, 266)": 415,
    "(302, 116)": 416,
    "(99, 116)": 417,
    "(276, 307)": 418,
    "(112, 101)": 419,
    "(107, 274)": 420,
    "(282, 328)": 421,
    "(372, 118)": 422,
    "(261, 340)": 423,
    "(117, 112)": 424,
    "(261, 367)": 425,
    "(256, 115)": 426,
    "(344, 109)": 427,
    "(116, 104)": 428,
    "(422, 279)": 429,
    "(267, 101)": 430,
    "(121, 290)": 431,
    "(429, 391)": 432,
    "(105, 318)": 433,
    "(256, 285)": 434,
    "(100, 111)": 435,
    "(105, 290)": 436,
    "(275, 427)": 437,
    "(119, 283)": 438,
    "(282, 403)": 439,
    "(281, 274)": 440,
    "(100, 310)": 441,
    "(264, 100)": 442,
    "(392, 310)": 443,
    "(412, 308)": 444,
    "(32, 349)": 445,
    "(289, 263)": 446,
    "(267, 99)": 447,
    "(97, 263)": 448,
    "(111, 121)": 449,
    "(116, 304)": 450,
    "(315, 110)": 451,
    "(105, 109)": 452,
    "(119, 101)": 453,
    "(275, 365)": 454,
    "(102, 101)": 455,
    "(32, 324)": 456,
    "(97, 287)": 457,
    "(103, 101)": 458,
    "(9, 105)": 459,
    "(110, 111)": 460,
    "(334, 383)": 461,
    "(97, 308)": 462,
    "(97, 109)": 463,
    "(270, 294)": 464,
    "(262, 110)": 465,
    "(265, 343)": 466,
    "(264, 101)": 467,
    "(281, 103)": 468,
    "(261, 399)": 469,
    "(289, 121)": 470,
    "(32, 114)": 471,
    "(115, 111)": 472,
    "(285, 111)": 473,
    "(277, 441)": 474,
    "(260, 402)": 475,
    "(105, 387)": 476,
    "(371, 104)": 477,
    "(301, 272)": 478,
    "(32, 424)": 479,
    "(109, 121)": 480,
    "(466, 314)": 481,
    "(269, 310)": 482,
    "(360, 285)": 483,
    "(32, 118)": 484,
    "(264, 107)": 485,
    "(289, 109)": 486,
    "(101, 309)": 487,
    "(260, 346)": 488,
    "(290, 115)": 489,
    "(117, 359)": 490,
    "(117, 263)": 491,
    "(309, 116)": 492,
    "(304, 115)": 493,
    "(266, 473)": 494,
    "(330, 116)": 495,
    "(288, 397)": 496,
    "(418, 108)": 497,
    "(362, 110)": 498,
    "(338, 101)": 499,
    "(334, 353)": 500,
    "(118, 274)": 501,
    "(332, 111)": 502,
    "(261, 303)": 503,
    "(267, 112)": 504,
    "(362, 364)": 505,
    "(261, 416)": 506,
    "(112, 112)": 507,
    "(109, 112)": 508,
    "(315, 303)": 509,
    "(265, 490)": 510,
    "(342, 101)": 511,
    "(290, 116)": 512,
    "(379, 104)": 513,
    "(288, 358)": 514,
    "(32, 279)": 515,
    "(415, 110)": 516,
    "(107, 115)": 517,
    "(32, 408)": 518,
    "(288, 111)": 519,
    "(318, 101)": 520,
    "(117, 108)": 521,
    "(298, 401)": 522,
    "(303, 101)": 523,
    "(124, 376)": 524,
    "(498, 358)": 525,
    "(321, 115)": 526,
    "(282, 294)": 527,
    "(32, 343)": 528,
    "(106, 449)": 529,
    "(291, 263)": 530,
    "(447, 522)": 531,
    "(279, 116)": 532,
    "(451, 529)": 533,
    "(381, 274)": 534,
    "(502, 98)": 535,
    "(505, 115)": 536,
    "(318, 103)": 537,
    "(97, 98)": 538,
    "(276, 108)": 539,
    "(503, 359)": 540,
    "(32, 342)": 541,
    "(108, 102)": 542,
    "(101, 111)": 543,
    "(267, 475)": 544,
    "(267, 104)": 545,
    "(298, 119)": 546,
    "(319, 330)": 547,
    "(121, 260)": 548,
    "(105, 101)": 549,
    "(119, 110)": 550,
    "(269, 101)": 551,
    "(312, 116)": 552,
    "(111, 308)": 553,
    "(105, 103)": 554,
    "(428, 274)": 555,
    "(362, 442)": 556,
    "(309, 100)": 557,
    "(119, 310)": 558,
    "(112, 354)": 559,
    "(256, 114)": 560,
    "(315, 120)": 561,
    "(276, 303)": 562,
    "(98, 101)": 563,
    "(258, 379)": 564,
    "(110, 294)": 565,
    "(265, 97)": 566,
    "(121, 513)": 567,
    "(275, 101)": 568,
    "(116, 274)": 569,
    "(265, 413)": 570,
    "(258, 368)": 571,
    "(258, 465)": 572,
    "(97, 407)": 573,
    "(101, 112)": 574,
    "(266, 121)": 575,
    "(268, 487)": 576,
    "(275, 341)": 577,
    "(374, 485)": 578,
    "(117, 109)": 579,
    "(260, 114)": 580,
    "(275, 511)": 581,
    "(98, 98)": 582,
    "(111, 263)": 583,
    "(394, 472)": 584,
    "(105, 306)": 585,
    "(105, 108)": 586,
    "(415, 263)": 587,
    "(374, 274)": 588,
    "(117, 100)": 589,
    "(269, 364)": 590,
    "(263, 101)": 591,
    "(324, 115)": 592,
    "(116, 121)": 593,
    "(117, 101)": 594,
    "(97, 306)": 595,
    "(105, 272)": 596,
    "(105, 102)": 597,
    "(105, 361)": 598,
    "(453, 285)": 599,
    "(340, 115)": 600,
    "(430, 101)": 601,
    "(377, 263)": 602,
    "(273, 108)": 603,
    "(276, 309)": 604,
    "(267, 266)": 605,
    "(110, 274)": 606,
    "(258, 101)": 607,
    "(276, 367)": 608,
    "(319, 116)": 609,
    "(372, 109)": 610,
    "(265, 302)": 611,
    "(97, 264)": 612,
    "(352, 263)": 613,
    "(290, 553)": 614,
    "(374, 488)": 615,
    "(119, 614)": 616,
    "(110, 101)": 617,
    "(320, 582)": 618,
    "(272, 108)": 619,
    "(468, 115)": 620,
    "(286, 326)": 621,
    "(384, 542)": 622,
    "(258, 592)": 623,
    "(388, 119)": 624,
    "(258, 347)": 625,
    "(291, 344)": 626,
    "(294, 393)": 627,
    "(322, 108)": 628,
    "(320, 308)": 629,
    "(282, 117)": 630,
    "(108, 279)": 631,
    "(545, 367)": 632,
    "(307, 108)": 633,
    "(116, 593)": 634,
    "(108, 112)": 635,
    "(265, 309)": 636,
    "(107, 290)": 637,
    "(105, 302)": 638,
    "(388, 331)": 639,
    "(104, 121)": 640,
    "(315, 408)": 641,
    "(119, 358)": 642,
    "(101, 108)": 643,
    "(285, 101)": 644,
    "(115, 115)": 645,
    "(328, 115)": 646,
    "(352, 635)": 647,
    "(610, 598)": 648,
    "(124, 411)": 649,
    "(310, 563)": 650,
    "(32, 272)": 651,
    "(319, 99)": 652,
    "(288, 462)": 653,
    "(388, 406)": 654,
    "(286, 107)": 655,
    "(260, 287)": 656,
    "(32, 344)": 657,
    "(338, 361)": 658,
    "(377, 109)": 659,
    "(260, 400)": 660,
    "(99, 105)": 661,
    "(291, 543)": 662,
    "(301, 306)": 663,
    "(117, 407)": 664,
    "(258, 114)": 665,
    "(370, 644)": 666,
    "(558, 115)": 667,
    "(257, 102)": 668,
    "(303, 433)": 669,
    "(662, 559)": 670,
    "(296, 100)": 671,
    "(97, 99)": 672,
    "(124, 324)": 673,
    "(663, 330)": 674,
    "(99, 633)": 675,
    "(258, 119)": 676,
    "(273, 307)": 677,
    "(541, 387)": 678,
    "(101, 263)": 679,
    "(343, 101)": 680,
    "(394, 667)": 681,
    "(258, 413)": 682,
    "(279, 347)": 683,
    "(342, 331)": 684,
    "(377, 118)": 685,
    "(301, 501)": 686,
    "(256, 417)": 687,
    "(530, 634)": 688,
    "(97, 680)": 689,
    "(110, 397)": 690,
    "(287, 304)": 691,
    "(273, 114)": 692,
    "(124, 438)": 693,
    "(276, 318)": 694,
    "(339, 115)": 695,
    "(571, 619)": 696,
    "(97, 103)": 697,
    "(281, 290)": 698,
    "(320, 419)": 699,
    "(98, 345)": 700,
    "(124, 431)": 701,
    "(296, 114)": 702,
    "(256, 102)": 703,
    "(269, 342)": 704,
    "(618, 436)": 705,
    "(103, 341)": 706,
    "(117, 383)": 707,
    "(270, 537)": 708,
    "(273, 512)": 709,
    "(679, 306)": 710,
    "(323, 102)": 711,
    "(276, 324)": 712,
    "(267, 491)": 713,
    "(370, 631)": 714,
    "(260, 115)": 715,
    "(400, 115)": 716,
    "(32, 368)": 717,
    "(301, 455)": 718,
    "(360, 101)": 719,
    "(256, 616)": 720,
    "(363, 589)": 721,
    "(32, 295)": 722,
    "(273, 343)": 723,
    "(105, 122)": 724,
    "(377, 306)": 725,
    "(297, 116)": 726,
    "(370, 508)": 727,
    "(261, 477)": 728,
    "(348, 452)": 729,
    "(297, 121)": 730,
    "(267, 274)": 731,
    "(286, 550)": 732,
    "(256, 103)": 733,
    "(267, 298)": 734,
    "(270, 307)": 735,
    "(276, 266)": 736,
    "(32, 117)": 737,
    "(291, 646)": 738,
    "(315, 272)": 739,
    "(463, 290)": 740,
    "(651, 103)": 741,
    "(113, 117)": 742,
    "(581, 402)": 743,
    "(471, 365)": 744,
    "(652, 689)": 745,
    "(116, 452)": 746,
    "(319, 97)": 747,
    "(261, 114)": 748,
    "(263, 110)": 749,
    "(124, 116)": 750,
    "(303, 393)": 751,
    "(666, 458)": 752,
    "(702, 100)": 753,
    "(418, 107)": 754,
    "(124, 435)": 755,
    "(297, 115)": 756,
    "(265, 650)": 757,
    "(352, 309)": 758,
    "(119, 266)": 759,
    "(676, 111)": 760,
    "(576, 115)": 761,
    "(99, 304)": 762,
    "(267, 683)": 763,
    "(273, 573)": 764,
    "(108, 290)": 765,
    "(282, 114)": 766,
    "(110, 103)": 767,
    "(267, 419)": 768,
    "(104, 314)": 769,
    "(124, 460)": 770,
    "(552, 710)": 771,
    "(273, 554)": 772,
    "(369, 274)": 773,
    "(111, 103)": 774,
    "(315, 406)": 775,
    "(746, 290)": 776,
    "(588, 115)": 777,
    "(32, 365)": 778,
    "(291, 111)": 779,
    "(448, 716)": 780,
    "(370, 109)": 781,
    "(116, 393)": 782,
    "(552, 111)": 783,
    "(263, 100)": 784,
    "(269, 114)": 785,
    "(275, 111)": 786,
    "(261, 298)": 787,
    "(568, 643)": 788,
    "(269, 302)": 789,
    "(275, 309)": 790,
    "(102, 521)": 791,
    "(261, 310)": 792,
    "(352, 114)": 793,
    "(286, 782)": 794,
    "(124, 494)": 795,
    "(258, 97)": 796,
    "(273, 111)": 797,
    "(273, 353)": 798,
    "(308, 400)": 799,
    "(319, 274)": 800,
    "(722, 574)": 801,
    "(276, 660)": 802,
    "(611, 121)": 803,
    "(291, 780)": 804,
    "(98, 354)": 805,
    "(540, 274)": 806,
    "(289, 110)": 807,
    "(726, 354)": 808,
    "(269, 353)": 809,
    "(607, 285)": 810,
    "(334, 108)": 811,
    "(264, 396)": 812,
    "(363, 399)": 813,
    "(712, 326)": 814,
    "(307, 110)": 815,
    "(270, 808)": 816,
    "(265, 356)": 817,
    "(263, 645)": 818,
    "(273, 117)": 819,
    "(273, 121)": 820,
    "(296, 409)": 821,
    "(296, 115)": 822,
    "(277, 110)": 823,
    "(267, 109)": 824,
    "(275, 477)": 825,
    "(504, 532)": 826,
    "(562, 115)": 827,
    "(282, 409)": 828,
    "(267, 546)": 829,
    "(703, 450)": 830,
    "(279, 115)": 831,
    "(116, 105)": 832,
    "(32, 283)": 833,
    "(636, 684)": 834,
    "(124, 115)": 835,
    "(560, 116)": 836,
    "(261, 339)": 837,
    "(267, 97)": 838,
    "(105, 97)": 839,
    "(282, 740)": 840,
    "(258, 339)": 841,
    "(288, 476)": 842,
    "(286, 406)": 843,
    "(729, 695)": 844,
    "(265, 467)": 845,
    "(261, 640)": 846,
    "(97, 122)": 847,
    "(704, 272)": 848,
    "(314, 107)": 849,
    "(269, 105)": 850,
    "(124, 480)": 851,
    "(296, 507)": 852,
    "(267, 310)": 853,
    "(564, 359)": 854,
    "(520, 121)": 855,
    "(297, 274)": 856,
    "(276, 448)": 857,
    "(410, 555)": 858,
    "(364, 101)": 859,
    "(291, 492)": 860,
    "(300, 622)": 861,
    "(724, 122)": 862,
    "(267, 812)": 863,
    "(32, 742)": 864,
    "(265, 855)": 865,
    "(102, 102)": 866,
    "(685, 436)": 867,
    "(862, 97)": 868,
    "(268, 290)": 869,
    "(771, 274)": 870,
    "(759, 263)": 871,
    "(98, 108)": 872,
    "(111, 109)": 873,
    "(263, 400)": 874,
    "(539, 600)": 875,
    "(609, 450)": 876,
    "(261, 105)": 877,
    "(500, 274)": 878,
    "(380, 622)": 879,
    "(405, 776)": 880,
    "(291, 612)": 881,
    "(823, 476)": 882,
    "(267, 119)": 883,
    "(97, 112)": 884,
    "(102, 116)": 885,
    "(258, 298)": 886,
    "(443, 274)": 887,
    "(833, 101)": 888,
    "(353, 101)": 889,
    "(581, 287)": 890,
    "(404, 343)": 891,
    "(493, 318)": 892,
    "(273, 457)": 893,
    "(309, 121)": 894,
    "(692, 627)": 895,
    "(826, 115)": 896,
    "(802, 347)": 897,
    "(528, 331)": 898,
    "(100, 101)": 899,
    "(392, 302)": 900,
    "(363, 492)": 901,
    "(262, 262)": 902,
    "(363, 310)": 903,
    "(395, 565)": 904,
    "(344, 119)": 905,
    "(291, 868)": 906,
    "(315, 108)": 907,
    "(421, 569)": 908,
    "(273, 340)": 909,
    "(124, 548)": 910,
    "(270, 101)": 911,
    "(687, 707)": 912,
    "(274, 115)": 913,
    "(273, 449)": 914,
    "(655, 310)": 915,
    "(269, 368)": 916,
    "(116, 101)": 917,
    "(267, 424)": 918,
    "(266, 100)": 919,
    "(275, 264)": 920,
    "(291, 892)": 921,
    "(364, 543)": 922,
    "(111, 115)": 923,
    "(370, 308)": 924,
    "(334, 100)": 925,
    "(405, 555)": 926,
    "(124, 567)": 927,
    "(267, 107)": 928,
    "(891, 98)": 929,
    "(324, 354)": 930,
    "(109, 304)": 931,
    "(456, 346)": 932,
    "(630, 489)": 933,
    "(110, 97)": 934,
    "(263, 463)": 935,
    "(9, 376)": 936,
    "(484, 922)": 937,
    "(677, 517)": 938,
    "(929, 457)": 939,
    "(270, 487)": 940,
    "(275, 108)": 941,
    "(719, 295)": 942,
    "(110, 121)": 943,
    "(564, 99)": 944,
    "(282, 263)": 945,
    "(267, 117)": 946,
    "(291, 309)": 947,
    "(275, 442)": 948,
    "(456, 109)": 949,
    "(302, 121)": 950,
    "(260, 384)": 951,
    "(279, 110)": 952,
    "(282, 368)": 953,
    "(721, 121)": 954,
    "(106, 356)": 955,
    "(32, 290)": 956,
    "(723, 121)": 957,
    "(786, 294)": 958,
    "(270, 97)": 959,
    "(907, 384)": 960,
    "(294, 104)": 961,
    "(124, 297)": 962,
    "(97, 396)": 963,
    "(108, 105)": 964,
    "(261, 930)": 965,
    "(276, 368)": 966,
    "(256, 100)": 967,
    "(269, 97)": 968,
    "(103, 328)": 969,
    "(560, 656)": 970,
    "(102, 583)": 971,
    "(657, 407)": 972,
    "(737, 691)": 973,
    "(739, 110)": 974,
    "(603, 594)": 975,
    "(677, 107)": 976,
    "(109, 115)": 977,
    "(877, 455)": 978,
    "(377, 272)": 979,
    "(261, 97)": 980,
    "(886, 384)": 981,
    "(625, 274)": 982,
    "(117, 285)": 983,
    "(768, 287)": 984,
    "(944, 393)": 985,
    "(828, 108)": 986,
    "(572, 517)": 987,
    "(814, 749)": 988,
    "(270, 379)": 989,
    "(273, 263)": 990,
    "(282, 462)": 991,
    "(883, 452)": 992,
    "(661, 383)": 993,
    "(319, 971)": 994,
    "(103, 403)": 995,
    "(267, 105)": 996,
    "(275, 467)": 997,
    "(114, 117)": 998,
    "(295, 116)": 999,
    "(271, 767)": 1000,
    "(336, 101)": 1001,
    "(275, 591)": 1002,
    "(566, 637)": 1003,
    "(117, 387)": 1004,
    "(266, 115)": 1005,
    "(351, 303)": 1006,
    "(351, 328)": 1007,
    "(97, 458)": 1008,
    "(296, 262)": 1009,
    "(371, 101)": 1010,
    "(102, 304)": 1011,
    "(99, 99)": 1012,
    "(124, 97)": 1013,
    "(258, 118)": 1014,
    "(98, 304)": 1015,
    "(528, 101)": 1016,
    "(350, 115)": 1017,
    "(276, 730)": 1018,
    "(747, 359)": 1019,
    "(276, 104)": 1020,
    "(261, 111)": 1021,
    "(484, 371)": 1022,
    "(419, 993)": 1023,
    "(509, 274)": 1024,
    "(725, 361)": 1025,
    "(291, 600)": 1026,
    "(339, 428)": 1027,
    "(109, 111)": 1028,
    "(302, 103)": 1029,
    "(318, 115)": 1030,
    "(267, 585)": 1031,
    "(124, 599)": 1032,
    "(267, 453)": 1033,
    "(295, 100)": 1034,
    "(109, 109)": 1035,
    "(273, 105)": 1036,
    "(108, 401)": 1037,
    "(98, 538)": 1038,
    "(956, 1023)": 1039,
    "(276, 298)": 1040,
    "(404, 951)": 1041,
    "(281, 617)": 1042,
    "(112, 116)": 1043,
    "(260, 387)": 1044,
    "(117, 866)": 1045,
    "(360, 263)": 1046,
    "(1038, 361)": 1047,
    "(269, 597)": 1048,
    "(116, 266)": 1049,
    "(273, 344)": 1050,
    "(265, 279)": 1051,
    "(258, 121)": 1052,
    "(276, 262)": 1053,
    "(334, 99)": 1054,
    "(112, 115)": 1055,
    "(111, 384)": 1056,
    "(267, 815)": 1057,
    "(97, 120)": 1058,
    "(261, 358)": 1059,
    "(368, 417)": 1060,
    "(530, 1011)": 1061,
    "(958, 700)": 1062,
    "(124, 642)": 1063,
    "(257, 508)": 1064,
    "(790, 109)": 1065,
    "(32, 580)": 1066,
    "(306, 457)": 1067,
    "(357, 326)": 1068,
    "(267, 414)": 1069,
    "(110, 304)": 1070,
    "(115, 859)": 1071,
    "(275, 409)": 1072,
    "(507, 274)": 1073,
    "(276, 414)": 1074,
    "(572, 107)": 1075,
    "(115, 112)": 1076,
    "(674, 274)": 1077,
    "(303, 331)": 1078,
    "(371, 115)": 1079,
    "(1051, 606)": 1080,
    "(769, 104)": 1081,
    "(102, 455)": 1082,
    "(111, 107)": 1083,
    "(811, 1058)": 1084,
    "(267, 262)": 1085,
    "(304, 103)": 1086,
    "(314, 339)": 1087,
    "(270, 595)": 1088,
    "(685, 549)": 1089,
    "(105, 715)": 1090,
    "(264, 489)": 1091,
    "(279, 107)": 1092,
    "(747, 336)": 1093,
    "(418, 420)": 1094,
    "(264, 116)": 1095,
    "(973, 1067)": 1096,
    "(275, 302)": 1097,
    "(735, 107)": 1098,
    "(267, 656)": 1099,
    "(741, 302)": 1100,
    "(940, 110)": 1101,
    "(334, 339)": 1102,
    "(290, 101)": 1103,
    "(264, 420)": 1104,
    "(789, 396)": 1105,
    "(379, 107)": 1106,
    "(97, 107)": 1107,
    "(785, 485)": 1108,
    "(103, 103)": 1109,
    "(99, 111)": 1110,
    "(338, 396)": 1111,
    "(116, 330)": 1112,
    "(511, 287)": 1113,
    "(268, 513)": 1114,
    "(268, 328)": 1115,
    "(363, 583)": 1116,
    "(352, 1027)": 1117,
    "(269, 371)": 1118,
    "(404, 365)": 1119,
    "(282, 108)": 1120,
    "(281, 550)": 1121,
    "(735, 420)": 1122,
    "(314, 116)": 1123,
    "(363, 1045)": 1124,
    "(568, 119)": 1125,
    "(104, 274)": 1126,
    "(124, 119)": 1127,
    "(120, 116)": 1128,
    "(392, 963)": 1129,
    "(265, 476)": 1130,
    "(1082, 101)": 1131,
    "(265, 328)": 1132,
    "(351, 302)": 1133,
    "(1022, 297)": 1134,
    "(270, 664)": 1135,
    "(124, 675)": 1136,
    "(557, 330)": 1137,
    "(285, 358)": 1138,
    "(352, 557)": 1139,
    "(456, 115)": 1140,
    "(124, 575)": 1141,
    "(334, 306)": 1142,
    "(299, 847)": 1143,
    "(661, 339)": 1144,
    "(261, 264)": 1145,
    "(719, 107)": 1146,
    "(265, 318)": 1147,
    "(374, 591)": 1148,
    "(916, 119)": 1149,
    "(370, 1131)": 1150,
    "(100, 121)": 1151,
    "(256, 507)": 1152,
    "(561, 99)": 1153,
    "(261, 495)": 1154,
    "(723, 1091)": 1155,
    "(276, 345)": 1156,
    "(766, 353)": 1157,
    "(404, 117)": 1158,
    "(942, 287)": 1159,
    "(100, 274)": 1160,
    "(282, 1137)": 1161,
    "(371, 919)": 1162,
    "(1021, 691)": 1163,
    "(953, 287)": 1164,
    "(314, 115)": 1165,
    "(626, 1047)": 1166,
    "(1028, 306)": 1167,
    "(604, 115)": 1168,
    "(267, 354)": 1169,
    "(665, 594)": 1170,
    "(291, 114)": 1171,
    "(112, 330)": 1172,
    "(289, 409)": 1173,
    "(124, 690)": 1174,
    "(314, 302)": 1175,
    "(115, 475)": 1176,
    "(109, 290)": 1177,
    "(404, 294)": 1178,
    "(267, 353)": 1179,
    "(116, 115)": 1180,
    "(273, 961)": 1181,
    "(404, 279)": 1182,
    "(276, 465)": 1183,
    "(256, 558)": 1184,
    "(124, 565)": 1185,
    "(748, 391)": 1186,
    "(451, 103)": 1187,
    "(265, 627)": 1188,
    "(579, 931)": 1189,
    "(269, 290)": 1190,
    "(669, 115)": 1191,
    "(261, 1081)": 1192,
    "(109, 650)": 1193,
    "(276, 339)": 1194,
    "(597, 521)": 1195,
    "(124, 706)": 1196,
    "(273, 309)": 1197,
    "(796, 420)": 1198,
    "(291, 304)": 1199,
    "(296, 501)": 1200,
    "(538, 354)": 1201,
    "(319, 108)": 1202,
    "(852, 121)": 1203,
    "(302, 396)": 1204,
    "(291, 414)": 1205,
    "(1072, 306)": 1206,
    "(734, 112)": 1207,
    "(464, 115)": 1208,
    "(282, 596)": 1209,
    "(1093, 1195)": 1210,
    "(263, 383)": 1211,
    "(297, 393)": 1212,
    "(388, 1128)": 1213,
    "(102, 279)": 1214,
    "(273, 413)": 1215,
    "(1143, 274)": 1216,
    "(267, 339)": 1217,
    "(454, 943)": 1218,
    "(323, 1112)": 1219,
    "(312, 306)": 1220,
    "(1033, 328)": 1221,
    "(276, 769)": 1222,
    "(322, 99)": 1223,
    "(1169, 574)": 1224,
    "(304, 99)": 1225,
    "(97, 104)": 1226,
    "(9, 411)": 1227,
    "(124, 546)": 1228,
    "(273, 297)": 1229,
    "(279, 121)": 1230,
    "(112, 108)": 1231,
    "(1048, 455)": 1232,
    "(541, 899)": 1233,
    "(122, 121)": 1234,
    "(721, 495)": 1235,
    "(270, 523)": 1236,
    "(734, 1073)": 1237,
    "(342, 387)": 1238,
    "(954, 274)": 1239,
    "(295, 114)": 1240,
    "(258, 345)": 1241,
    "(98, 115)": 1242,
    "(641, 555)": 1243,
    "(566, 420)": 1244,
    "(116, 465)": 1245,
    "(630, 121)": 1246,
    "(265, 331)": 1247,
    "(334, 832)": 1248,
    "(102, 264)": 1249,
    "(275, 105)": 1250,
    "(97, 359)": 1251,
    "(482, 115)": 1252,
    "(727, 336)": 1253,
    "(267, 462)": 1254,
    "(618, 121)": 1255,
    "(121, 99)": 1256,
    "(109, 274)": 1257,
    "(372, 306)": 1258,
    "(109, 302)": 1259,
    "(360, 309)": 1260,
    "(404, 580)": 1261,
    "(881, 116)": 1262,
    "(368, 112)": 1263,
    "(528, 707)": 1264,
    "(116, 575)": 1265,
    "(108, 111)": 1266,
    "(824, 345)": 1267,
    "(945, 330)": 1268,
    "(315, 309)": 1269,
    "(500, 121)": 1270,
    "(265, 1079)": 1271,
    "(1232, 874)": 1272,
    "(9, 431)": 1273,
    "(430, 285)": 1274,
    "(603, 573)": 1275,
    "(996, 872)": 1276,
    "(276, 283)": 1277,
    "(267, 110)": 1278,
    "(918, 304)": 1279,
    "(296, 767)": 1280,
    "(741, 328)": 1281,
    "(291, 310)": 1282,
    "(451, 488)": 1283,
    "(297, 309)": 1284,
    "(288, 414)": 1285,
    "(303, 274)": 1286,
    "(837, 107)": 1287,
    "(665, 664)": 1288,
    "(256, 1012)": 1289,
    "(819, 121)": 1290,
    "(309, 638)": 1291,
    "(920, 1162)": 1292,
    "(370, 326)": 1293,
    "(108, 467)": 1294,
    "(445, 1071)": 1295,
    "(286, 104)": 1296,
    "(1276, 913)": 1297,
    "(112, 304)": 1298,
    "(103, 304)": 1299,
    "(263, 115)": 1300,
    "(267, 304)": 1301,
    "(739, 606)": 1302,
    "(1074, 874)": 1303,
    "(330, 396)": 1304,
    "(409, 100)": 1305,
    "(630, 1284)": 1306,
    "(267, 318)": 1307,
    "(119, 119)": 1308,
    "(1147, 428)": 1309,
    "(116, 97)": 1310,
    "(265, 889)": 1311,
    "(647, 115)": 1312,
    "(388, 309)": 1313,
    "(374, 114)": 1314,
    "(282, 905)": 1315,
    "(841, 107)": 1316,
    "(990, 1107)": 1317,
    "(269, 264)": 1318,
    "(966, 1234)": 1319,
    "(276, 97)": 1320,
    "(98, 111)": 1321,
    "(430, 330)": 1322,
    "(980, 297)": 1323,
    "(968, 1004)": 1324,
    "(291, 117)": 1325,
    "(124, 472)": 1326,
    "(124, 99)": 1327,
    "(412, 1177)": 1328,
    "(277, 969)": 1329,
    "(1249, 391)": 1330,
    "(1329, 393)": 1331,
    "(666, 417)": 1332,
    "(549, 272)": 1333,
    "(303, 304)": 1334,
    "(105, 118)": 1335,
    "(395, 116)": 1336,
    "(433, 115)": 1337,
    "(1330, 361)": 1338,
    "(360, 751)": 1339,
    "(98, 114)": 1340,
    "(303, 104)": 1341,
    "(315, 1212)": 1342,
    "(110, 115)": 1343,
    "(394, 294)": 1344,
    "(340, 318)": 1345,
    "(279, 274)": 1346,
    "(1031, 304)": 1347,
    "(733, 111)": 1348,
    "(303, 116)": 1349,
    "(49, 48)": 1350,
    "(267, 1189)": 1351,
    "(626, 102)": 1352,
    "(1117, 121)": 1353,
    "(109, 97)": 1354,
    "(456, 420)": 1355,
    "(852, 330)": 1356,
    "(727, 950)": 1357,
    "(315, 340)": 1358,
    "(9, 438)": 1359,
    "(825, 274)": 1360,
    "(111, 112)": 1361,
    "(545, 532)": 1362,
    "(434, 1086)": 1363,
    "(273, 97)": 1364,
    "(265, 586)": 1365,
    "(97, 414)": 1366,
    "(338, 1294)": 1367,
    "(265, 442)": 1368,
    "(302, 115)": 1369,
    "(262, 272)": 1370,
    "(269, 935)": 1371,
    "(394, 520)": 1372,
    "(959, 119)": 1373,
    "(321, 339)": 1374,
    "(1366, 416)": 1375,
    "(495, 361)": 1376,
    "(653, 100)": 1377,
    "(733, 591)": 1378,
    "(561, 1225)": 1379,
    "(489, 433)": 1380,
    "(108, 328)": 1381,
    "(1142, 1375)": 1382,
    "(744, 606)": 1383,
    "(1052, 419)": 1384,
    "(264, 115)": 1385,
    "(291, 328)": 1386,
    "(901, 331)": 1387,
    "(836, 585)": 1388,
    "(1303, 361)": 1389,
    "(267, 297)": 1390,
    "(257, 100)": 1391,
    "(303, 491)": 1392,
    "(895, 115)": 1393,
    "(112, 274)": 1394,
    "(1202, 1333)": 1395,
    "(731, 354)": 1396,
    "(352, 353)": 1397,
    "(99, 401)": 1398,
    "(257, 287)": 1399,
    "(380, 115)": 1400,
    "(309, 115)": 1401,
    "(276, 354)": 1402,
    "(999, 700)": 1403,
    "(257, 396)": 1404,
    "(841, 420)": 1405,
    "(97, 616)": 1406,
    "(303, 115)": 1407,
    "(694, 762)": 1408,
    "(270, 328)": 1409,
    "(275, 345)": 1410,
    "(99, 762)": 1411,
    "(282, 344)": 1412,
    "(121, 379)": 1413,
    "(108, 457)": 1414,
    "(263, 353)": 1415,
    "(1223, 339)": 1416,
    "(273, 538)": 1417,
    "(9, 435)": 1418,
    "(774, 97)": 1419,
    "(539, 1056)": 1420,
    "(121, 109)": 1421,
    "(276, 580)": 1422,
    "(1157, 117)": 1423,
    "(1084, 274)": 1424,
    "(1398, 523)": 1425,
    "(369, 115)": 1426,
    "(99, 274)": 1427,
    "(909, 1403)": 1428,
    "(340, 101)": 1429,
    "(275, 751)": 1430,
    "(989, 306)": 1431,
    "(363, 114)": 1432,
    "(342, 290)": 1433,
    "(1379, 1010)": 1434,
    "(277, 109)": 1435,
    "(108, 274)": 1436,
    "(276, 1001)": 1437,
    "(736, 1103)": 1438,
    "(268, 1419)": 1439,
    "(9, 460)": 1440,
    "(104, 294)": 1441,
    "(119, 557)": 1442,
    "(374, 1104)": 1443,
    "(406, 115)": 1444,
    "(564, 109)": 1445,
    "(1205, 559)": 1446,
    "(405, 520)": 1447,
    "(258, 304)": 1448,
    "(258, 330)": 1449,
    "(864, 391)": 1450,
    "(909, 101)": 1451,
    "(337, 115)": 1452,
    "(1163, 791)": 1453,
    "(306, 304)": 1454,
    "(521, 116)": 1455,
    "(506, 331)": 1456,
    "(1352, 1380)": 1457,
    "(291, 595)": 1458,
    "(112, 263)": 1459,
    "(327, 1411)": 1460,
    "(504, 1106)": 1461,
    "(484, 401)": 1462,
    "(103, 302)": 1463,
    "(947, 107)": 1464,
    "(374, 1044)": 1465,
    "(414, 110)": 1466,
    "(781, 109)": 1467,
    "(831, 290)": 1468,
    "(275, 114)": 1469,
    "(282, 330)": 1470,
    "(551, 103)": 1471,
    "(258, 342)": 1472,
    "(1318, 1070)": 1473,
    "(9, 324)": 1474,
    "(119, 640)": 1475,
    "(1069, 102)": 1476,
    "(445, 435)": 1477,
    "(291, 336)": 1478,
    "(273, 1346)": 1479,
    "(295, 121)": 1480,
    "(324, 112)": 1481,
    "(1253, 304)": 1482,
    "(342, 805)": 1483,
    "(404, 414)": 1484,
    "(412, 784)": 1485,
    "(1054, 1376)": 1486,
    "(282, 1421)": 1487,
    "(339, 101)": 1488,
    "(281, 417)": 1489,
    "(99, 266)": 1490,
    "(404, 1468)": 1491,
    "(276, 260)": 1492,
    "(828, 542)": 1493,
    "(571, 264)": 1494,
    "(729, 339)": 1495,
    "(257, 109)": 1496,
    "(704, 501)": 1497,
    "(1261, 115)": 1498,
    "(733, 612)": 1499,
    "(364, 97)": 1500,
    "(911, 885)": 1501,
    "(268, 1092)": 1502,
    "(97, 417)": 1503,
    "(504, 448)": 1504,
    "(124, 756)": 1505,
    "(101, 417)": 1506,
    "(471, 307)": 1507,
    "(471, 751)": 1508,
    "(774, 1263)": 1509,
    "(1040, 1425)": 1510,
    "(294, 115)": 1511,
    "(265, 310)": 1512,
    "(1285, 384)": 1513,
    "(914, 115)": 1514,
    "(631, 1500)": 1515,
    "(302, 458)": 1516,
    "(1145, 450)": 1517,
    "(1153, 856)": 1518,
    "(551, 1338)": 1519,
    "(351, 120)": 1520,
    "(1029, 117)": 1521,
    "(394, 1167)": 1522,
    "(270, 1521)": 1523,
    "(447, 105)": 1524,
    "(1459, 634)": 1525,
    "(256, 112)": 1526,
    "(918, 112)": 1527,
    "(276, 463)": 1528,
    "(267, 365)": 1529,
    "(621, 304)": 1530,
    "(352, 473)": 1531,
    "(295, 110)": 1532,
    "(491, 115)": 1533,
    "(276, 935)": 1534,
    "(50, 48)": 1535,
    "(291, 1441)": 1536,
    "(273, 345)": 1537,
    "(1064, 532)": 1538,
    "(750, 266)": 1539,
    "(100, 117)": 1540,
    "(291, 294)": 1541,
    "(749, 359)": 1542,
    "(275, 983)": 1543,
    "(1471, 591)": 1544,
    "(1190, 554)": 1545,
    "(979, 100)": 1546,
    "(503, 304)": 1547,
    "(304, 116)": 1548,
    "(1391, 379)": 1549,
    "(365, 917)": 1550,
    "(108, 314)": 1551,
    "(1026, 433)": 1552,
    "(298, 617)": 1553,
    "(291, 1060)": 1554,
    "(360, 1305)": 1555,
    "(1462, 1550)": 1556,
    "(314, 97)": 1557,
    "(32, 122)": 1558,
    "(456, 295)": 1559,
    "(276, 403)": 1560,
    "(748, 856)": 1561,
    "(275, 1515)": 1562,
    "(1477, 831)": 1563,
    "(1036, 295)": 1564,
    "(291, 638)": 1565,
    "(365, 359)": 1566,
    "(1120, 353)": 1567,
    "(124, 98)": 1568,
    "(109, 467)": 1569,
    "(312, 450)": 1570,
    "(325, 1126)": 1571,
    "(297, 331)": 1572,
    "(711, 397)": 1573,
    "(837, 420)": 1574,
    "(992, 1257)": 1575,
    "(302, 107)": 1576,
    "(426, 420)": 1577,
    "(275, 1542)": 1578,
    "(318, 290)": 1579,
    "(258, 684)": 1580,
    "(267, 537)": 1581,
    "(108, 477)": 1582,
    "(597, 952)": 1583,
    "(102, 983)": 1584,
    "(105, 326)": 1585,
    "(1583, 839)": 1586,
    "(472, 308)": 1587,
    "(1422, 384)": 1588,
    "(256, 336)": 1589,
    "(99, 121)": 1590,
    "(322, 306)": 1591,
    "(1538, 416)": 1592,
    "(1374, 638)": 1593,
    "(664, 115)": 1594,
    "(617, 121)": 1595,
    "(99, 331)": 1596,
    "(1050, 550)": 1597,
    "(291, 485)": 1598,
    "(1417, 121)": 1599,
    "(1496, 697)": 1600,
    "(1493, 1113)": 1601,
    "(1556, 304)": 1602,
    "(1451, 700)": 1603,
    "(348, 627)": 1604,
    "(291, 354)": 1605,
    "(566, 106)": 1606,
    "(829, 115)": 1607,
    "(256, 435)": 1608,
    "(860, 121)": 1609,
    "(1584, 121)": 1610,
    "(914, 102)": 1611,
    "(124, 308)": 1612,
    "(1248, 784)": 1613,
    "(779, 112)": 1614,
    "(291, 849)": 1615,
    "(1565, 111)": 1616,
    "(1314, 488)": 1617,
    "(101, 406)": 1618,
    "(835, 475)": 1619,
    "(285, 274)": 1620,
    "(717, 112)": 1621,
    "(258, 672)": 1622,
    "(288, 279)": 1623,
    "(1402, 302)": 1624,
    "(832, 308)": 1625,
    "(455, 417)": 1626,
    "(1611, 1113)": 1627,
    "(265, 105)": 1628,
    "(986, 115)": 1629,
    "(276, 413)": 1630,
    "(884, 302)": 1631,
    "(115, 491)": 1632,
    "(110, 489)": 1633,
    "(1194, 1586)": 1634,
    "(353, 97)": 1635,
    "(105, 111)": 1636,
    "(256, 458)": 1637,
    "(299, 304)": 1638,
    "(414, 274)": 1639,
    "(363, 818)": 1640,
    "(850, 328)": 1641,
    "(1324, 304)": 1642,
    "(275, 580)": 1643,
    "(551, 99)": 1644,
    "(297, 304)": 1645,
    "(256, 119)": 1646,
    "(332, 101)": 1647,
    "(9, 480)": 1648,
    "(267, 490)": 1649,
    "(291, 401)": 1650,
    "(296, 287)": 1651,
    "(272, 115)": 1652,
    "(291, 101)": 1653,
    "(1158, 458)": 1654,
    "(766, 889)": 1655,
    "(99, 290)": 1656,
    "(102, 532)": 1657,
    "(109, 1015)": 1658,
    "(717, 264)": 1659,
    "(942, 402)": 1660,
    "(759, 110)": 1661,
    "(430, 99)": 1662,
    "(288, 97)": 1663,
    "(319, 100)": 1664,
    "(900, 115)": 1665,
    "(294, 1005)": 1666,
    "(332, 1631)": 1667,
    "(117, 98)": 1668,
    "(124, 102)": 1669,
    "(964, 295)": 1670,
    "(32, 59)": 1671,
    "(273, 399)": 1672,
    "(447, 448)": 1673,
    "(396, 1043)": 1674,
    "(801, 115)": 1675,
    "(115, 274)": 1676,
    "(873, 302)": 1677,
    "(694, 115)": 1678,
    "(538, 765)": 1679,
    "(121, 101)": 1680,
    "(750, 575)": 1681,
    "(696, 274)": 1682,
    "(297, 339)": 1683,
    "(273, 368)": 1684,
    "(484, 111)": 1685,
    "(338, 290)": 1686,
    "(847, 122)": 1687,
    "(124, 448)": 1688,
    "(519, 619)": 1689,
    "(626, 805)": 1690,
    "(535, 115)": 1691,
    "(363, 523)": 1692,
    "(1031, 493)": 1693,
    "(297, 433)": 1694,
    "(124, 902)": 1695,
    "(118, 121)": 1696,
    "(443, 331)": 1697,
    "(288, 1392)": 1698,
    "(303, 111)": 1699,
    "(539, 1666)": 1700,
    "(270, 108)": 1701,
    "(819, 1585)": 1702,
    "(105, 308)": 1703,
    "(270, 489)": 1704,
    "(484, 105)": 1705,
    "(881, 569)": 1706,
    "(386, 116)": 1707,
    "(263, 116)": 1708,
    "(256, 99)": 1709,
    "(277, 116)": 1710,
    "(1449, 110)": 1711,
    "(291, 342)": 1712,
    "(1245, 107)": 1713,
    "(319, 304)": 1714,
    "(1526, 492)": 1715,
    "(692, 274)": 1716,
    "(421, 115)": 1717,
    "(430, 1345)": 1718,
    "(1187, 1582)": 1719,
    "(106, 1506)": 1720,
    "(537, 114)": 1721,
    "(342, 306)": 1722,
    "(357, 1034)": 1723,
    "(697, 290)": 1724,
    "(276, 340)": 1725,
    "(112, 290)": 1726,
    "(265, 660)": 1727,
    "(273, 952)": 1728,
    "(118, 279)": 1729,
    "(946, 98)": 1730,
    "(261, 1677)": 1731,
    "(286, 1172)": 1732,
    "(279, 905)": 1733,
    "(672, 290)": 1734,
    "(276, 457)": 1735,
    "(556, 115)": 1736,
    "(401, 774)": 1737,
    "(327, 1144)": 1738,
    "(389, 107)": 1739,
    "(1600, 467)": 1740,
    "(652, 553)": 1741,
    "(303, 290)": 1742,
    "(111, 287)": 1743,
    "(1281, 1291)": 1744,
    "(270, 413)": 1745,
    "(301, 1340)": 1746,
    "(1489, 279)": 1747,
    "(789, 1427)": 1748,
    "(124, 955)": 1749,
    "(258, 595)": 1750,
    "(9, 297)": 1751,
    "(267, 108)": 1752,
    "(824, 111)": 1753,
    "(124, 995)": 1754,
    "(750, 465)": 1755,
    "(365, 107)": 1756,
    "(917, 287)": 1757,
    "(355, 115)": 1758,
    "(105, 263)": 1759,
    "(99, 97)": 1760,
    "(579, 115)": 1761,
    "(265, 264)": 1762,
    "(315, 431)": 1763,
    "(1095, 710)": 1764,
    "(314, 383)": 1765,
    "(426, 107)": 1766,
    "(330, 384)": 1767,
    "(99, 1480)": 1768,
    "(291, 97)": 1769,
    "(103, 111)": 1770,
    "(1363, 314)": 1771,
    "(332, 1687)": 1772,
    "(9, 548)": 1773,
    "(1222, 1532)": 1774,
    "(124, 453)": 1775,
    "(281, 110)": 1776,
    "(124, 112)": 1777,
    "(838, 364)": 1778,
    "(258, 1349)": 1779,
    "(1779, 307)": 1780,
    "(551, 339)": 1781,
    "(1182, 384)": 1782,
    "(276, 462)": 1783,
    "(260, 100)": 1784,
    "(1358, 121)": 1785,
    "(332, 117)": 1786,
    "(390, 354)": 1787,
    "(447, 894)": 1788,
    "(318, 934)": 1789,
    "(1020, 414)": 1790,
    "(275, 583)": 1791,
    "(103, 115)": 1792,
    "(989, 272)": 1793,
    "(1309, 115)": 1794,
    "(1220, 998)": 1795,
    "(291, 1123)": 1796,
    "(101, 353)": 1797,
    "(589, 101)": 1798,
    "(115, 290)": 1799,
    "(261, 309)": 1800,
    "(566, 103)": 1801,
    "(315, 1251)": 1802,
    "(1280, 274)": 1803,
    "(114, 318)": 1804,
    "(116, 117)": 1805,
    "(796, 637)": 1806,
    "(533, 274)": 1807,
    "(363, 309)": 1808,
    "(115, 596)": 1809,
    "(945, 119)": 1810,
    "(363, 457)": 1811,
    "(267, 343)": 1812,
    "(566, 264)": 1813,
    "(1764, 274)": 1814,
    "(372, 417)": 1815,
    "(1727, 612)": 1816,
    "(267, 349)": 1817,
    "(115, 683)": 1818,
    "(315, 1109)": 1819,
    "(363, 279)": 1820,
    "(1245, 517)": 1821,
    "(282, 101)": 1822,
    "(269, 1639)": 1823,
    "(272, 110)": 1824,
    "(273, 1044)": 1825,
    "(394, 537)": 1826,
    "(857, 304)": 1827,
    "(315, 287)": 1828,
    "(561, 116)": 1829,
    "(364, 495)": 1830,
    "(1606, 279)": 1831,
    "(265, 364)": 1832,
    "(320, 1768)": 1833,
    "(108, 489)": 1834,
    "(100, 364)": 1835,
    "(521, 309)": 1836,
    "(113, 594)": 1837,
    "(100, 304)": 1838,
    "(641, 520)": 1839,
    "(404, 579)": 1840,
    "(788, 274)": 1841,
    "(320, 1076)": 1842,
    "(105, 328)": 1843,
    "(1269, 361)": 1844,
    "(1790, 359)": 1845,
    "(381, 100)": 1846,
    "(275, 596)": 1847,
    "(363, 1106)": 1848,
    "(1435, 1733)": 1849,
    "(115, 266)": 1850,
    "(298, 108)": 1851,
    "(1020, 1722)": 1852,
    "(875, 290)": 1853,
    "(1289, 660)": 1854,
    "(258, 488)": 1855,
    "(261, 331)": 1856,
    "(607, 359)": 1857,
    "(557, 115)": 1858,
    "(314, 104)": 1859,
    "(940, 606)": 1860,
    "(121, 354)": 1861,
    "(51, 48)": 1862,
    "(392, 1734)": 1863,
    "(484, 672)": 1864,
    "(277, 550)": 1865,
    "(1325, 872)": 1866,
    "(395, 1635)": 1867,
    "(9, 567)": 1868,
    "(1083, 310)": 1869,
    "(607, 120)": 1870,
    "(124, 1037)": 1871,
    "(273, 409)": 1872,
    "(269, 818)": 1873,
    "(115, 401)": 1874,
    "(731, 274)": 1875,
    "(1412, 762)": 1876,
    "(1220, 1797)": 1877,
    "(267, 849)": 1878,
    "(1872, 428)": 1879,
    "(337, 361)": 1880,
    "(267, 324)": 1881,
    "(109, 583)": 1882,
    "(1842, 1683)": 1883,
    "(360, 476)": 1884,
    "(941, 358)": 1885,
    "(916, 103)": 1886,
    "(103, 368)": 1887,
    "(99, 343)": 1888,
    "(99, 302)": 1889,
    "(1132, 339)": 1890,
    "(1135, 121)": 1891,
    "(9, 494)": 1892,
    "(265, 99)": 1893,
    "(1199, 1626)": 1894,
    "(768, 1144)": 1895,
    "(466, 101)": 1896,
    "(1874, 1001)": 1897,
    "(577, 115)": 1898,
    "(352, 121)": 1899,
    "(1064, 818)": 1900,
    "(850, 331)": 1901,
    "(601, 977)": 1902,
    "(287, 310)": 1903,
    "(1711, 371)": 1904,
    "(541, 1160)": 1905,
    "(320, 110)": 1906,
    "(289, 384)": 1907,
    "(748, 537)": 1908,
    "(9, 599)": 1909,
    "(365, 523)": 1910,
    "(103, 347)": 1911,
    "(364, 115)": 1912,
    "(265, 314)": 1913,
    "(286, 396)": 1914,
    "(275, 361)": 1915,
    "(579, 480)": 1916,
    "(119, 1092)": 1917,
    "(586, 115)": 1918,
    "(1715, 799)": 1919,
    "(273, 414)": 1920,
    "(288, 304)": 1921,
    "(275, 416)": 1922,
    "(736, 407)": 1923,
    "(124, 408)": 1924,
    "(1536, 1509)": 1925,
    "(796, 1004)": 1926,
    "(854, 274)": 1927,
    "(1277, 569)": 1928,
    "(275, 297)": 1929,
    "(410, 520)": 1930,
    "(124, 871)": 1931,
    "(1914, 302)": 1932,
    "(1448, 1483)": 1933,
    "(275, 340)": 1934,
    "(124, 121)": 1935,
    "(312, 99)": 1936,
    "(1364, 420)": 1937,
    "(318, 97)": 1938,
    "(405, 441)": 1939,
    "(275, 998)": 1940,
    "(276, 344)": 1941,
    "(270, 353)": 1942,
    "(267, 379)": 1943,
    "(115, 104)": 1944,
    "(1300, 104)": 1945,
    "(741, 103)": 1946,
    "(275, 586)": 1947,
    "(778, 105)": 1948,
    "(561, 1172)": 1949,
    "(1101, 331)": 1950,
    "(315, 354)": 1951,
    "(288, 740)": 1952,
    "(1472, 112)": 1953,
    "(508, 108)": 1954,
    "(258, 263)": 1955,
    "(109, 340)": 1956,
    "(319, 303)": 1957,
    "(811, 1191)": 1958,
    "(568, 328)": 1959,
    "(1554, 397)": 1960,
    "(601, 109)": 1961,
    "(394, 1238)": 1962,
    "(302, 101)": 1963,
    "(258, 1466)": 1964,
    "(117, 346)": 1965,
    "(117, 290)": 1966,
    "(270, 1334)": 1967,
    "(928, 105)": 1968,
    "(1250, 120)": 1969,
    "(272, 400)": 1970,
    "(837, 517)": 1971,
    "(824, 492)": 1972,
    "(271, 1805)": 1973,
    "(99, 262)": 1974,
    "(401, 264)": 1975,
    "(267, 1594)": 1976,
    "(291, 633)": 1977,
    "(626, 1887)": 1978,
    "(1523, 1724)": 1979,
    "(1119, 569)": 1980,
    "(114, 594)": 1981,
    "(1278, 358)": 1982,
    "(100, 643)": 1983,
    "(1183, 458)": 1984,
    "(1423, 1078)": 1985,
    "(372, 396)": 1986,
    "(269, 344)": 1987,
    "(785, 1104)": 1988,
    "(301, 637)": 1989,
    "(507, 331)": 1990,
    "(1973, 563)": 1991,
    "(110, 815)": 1992,
    "(1690, 109)": 1993,
    "(275, 1945)": 1994,
    "(1415, 121)": 1995,
    "(1954, 449)": 1996,
    "(100, 115)": 1997,
    "(1520, 1175)": 1998,
    "(1524, 1304)": 1999,
    "(315, 400)": 2000,
    "(1949, 1809)": 2001,
    "(364, 290)": 2002,
    "(118, 397)": 2003,
    "(330, 115)": 2004,
    "(359, 274)": 2005,
    "(830, 1992)": 2006,
    "(276, 336)": 2007,
    "(556, 97)": 2008,
    "(105, 495)": 2009,
    "(268, 101)": 2010,
    "(603, 1743)": 2011,
    "(1408, 1180)": 2012,
    "(100, 354)": 2013,
    "(334, 308)": 2014,
    "(394, 1995)": 2015,
    "(605, 108)": 2016,
    "(410, 1882)": 2017,
    "(1657, 1910)": 2018,
    "(1013, 616)": 2019,
    "(337, 100)": 2020,
    "(404, 297)": 2021,
    "(307, 107)": 2022,
    "(478, 115)": 2023,
    "(694, 116)": 2024,
    "(102, 314)": 2025,
    "(334, 109)": 2026,
    "(641, 441)": 2027,
    "(1897, 361)": 2028,
    "(797, 303)": 2029,
    "(104, 1035)": 2030,
    "(268, 97)": 2031,
    "(1246, 115)": 2032,
    "(105, 346)": 2033,
    "(1864, 669)": 2034,
    "(267, 452)": 2035,
    "(1870, 340)": 2036,
    "(276, 279)": 2037,
    "(549, 326)": 2038,
    "(1735, 121)": 2039,
    "(267, 308)": 2040,
    "(285, 115)": 2041,
    "(1819, 115)": 2042,
    "(363, 1361)": 2043,
    "(320, 1394)": 2044,
    "(1876, 121)": 2045,
    "(507, 304)": 2046,
    "(124, 1193)": 2047,
    "(1662, 1708)": 2048,
    "(498, 101)": 2049,
    "(267, 859)": 2050,
    "(781, 274)": 2051,
    "(2014, 1658)": 2052,
    "(850, 1729)": 2053,
    "(9, 642)": 2054,
    "(265, 303)": 2055,
    "(443, 304)": 2056,
    "(697, 111)": 2057,
    "(1622, 923)": 2058,
    "(1053, 114)": 2059,
    "(1026, 331)": 2060,
    "(101, 330)": 2061,
    "(1266, 272)": 2062,
    "(527, 1310)": 2063,
    "(276, 492)": 2064,
    "(124, 109)": 2065,
    "(478, 100)": 2066,
    "(265, 1341)": 2067,
    "(1281, 1679)": 2068,
    "(1214, 100)": 2069,
    "(515, 1516)": 2070,
    "(261, 318)": 2071,
    "(560, 480)": 2072,
    "(282, 304)": 2073,
    "(267, 328)": 2074,
    "(280, 124)": 2075,
    "(100, 100)": 2076,
    "(276, 114)": 2077,
    "(270, 309)": 2078,
    "(551, 1551)": 2079,
    "(115, 99)": 2080,
    "(1796, 1533)": 2081,
    "(996, 120)": 2082,
    "(308, 716)": 2083,
    "(838, 272)": 2084,
    "(103, 117)": 2085,
    "(1817, 104)": 2086,
    "(1605, 1429)": 2087,
    "(471, 1859)": 2088,
    "(1812, 324)": 2089,
    "(362, 399)": 2090,
    "(1608, 1043)": 2091,
    "(264, 290)": 2092,
    "(270, 538)": 2093,
    "(1390, 569)": 2094,
    "(297, 436)": 2095,
    "(2079, 1090)": 2096,
    "(1156, 331)": 2097,
    "(980, 856)": 2098,
    "(405, 1625)": 2099,
    "(256, 409)": 2100,
    "(417, 433)": 2101,
    "(724, 101)": 2102,
    "(265, 294)": 2103,
    "(551, 353)": 2104,
    "(727, 328)": 2105,
    "(456, 306)": 2106,
    "(282, 463)": 2107,
    "(1587, 776)": 2108,
    "(1492, 559)": 2109,
    "(734, 290)": 2110,
    "(610, 715)": 2111,
    "(282, 1789)": 2112,
    "(291, 303)": 2113,
    "(1673, 100)": 2114,
    "(838, 119)": 2115,
    "(717, 371)": 2116,
    "(363, 111)": 2117,
    "(1248, 263)": 2118,
    "(920, 477)": 2119,
    "(103, 493)": 2120,
    "(313, 97)": 2121,
    "(1408, 116)": 2122,
    "(312, 118)": 2123,
    "(539, 1668)": 2124,
    "(736, 102)": 2125,
    "(291, 549)": 2126,
    "(778, 116)": 2127,
    "(1938, 326)": 2128,
    "(946, 1903)": 2129,
    "(275, 263)": 2130,
    "(1381, 101)": 2131,
    "(1236, 361)": 2132,
    "(583, 100)": 2133,
    "(333, 115)": 2134,
    "(32, 427)": 2135,
    "(1737, 121)": 2136,
    "(1689, 115)": 2137,
    "(1710, 383)": 2138,
    "(1120, 600)": 2139,
    "(100, 2128)": 2140,
    "(1222, 2057)": 2141,
    "(1158, 104)": 2142,
    "(1829, 368)": 2143,
    "(1123, 433)": 2144,
    "(275, 656)": 2145,
    "(967, 100)": 2146,
    "(114, 279)": 2147,
    "(275, 476)": 2148,
    "(363, 101)": 2149,
    "(786, 1138)": 2150,
    "(471, 353)": 2151,
    "(276, 101)": 2152,
    "(348, 110)": 2153,
    "(1153, 1572)": 2154,
    "(1187, 467)": 2155,
    "(290, 2002)": 2156,
    "(1879, 441)": 2157,
    "(787, 354)": 2158,
    "(124, 103)": 2159,
    "(484, 302)": 2160,
    "(115, 462)": 2161,
    "(101, 120)": 2162,
    "(375, 349)": 2163,
    "(1476, 274)": 2164,
    "(124, 266)": 2165,
    "(416, 115)": 2166,
    "(282, 520)": 2167,
    "(1085, 263)": 2168,
    "(124, 1211)": 2169,
    "(1217, 290)": 2170,
    "(261, 104)": 2171,
    "(257, 112)": 2172,
    "(624, 115)": 2173,
    "(270, 1566)": 2174,
    "(372, 272)": 2175,
    "(117, 339)": 2176,
    "(430, 119)": 2177,
    "(1119, 1911)": 2178,
    "(561, 1674)": 2179,
    "(98, 414)": 2180,
    "(1545, 110)": 2181,
    "(657, 353)": 2182,
    "(315, 100)": 2183,
    "(430, 1110)": 2184,
    "(1638, 1175)": 2185,
    "(1020, 264)": 2186,
